[
  {
    "title": "NEDs Reimagined Report Published",
    "date": "2026-01-14",
    "description": "The IoD Centre for Corporate Governance publishes the NEDs Reimagined report, co-authored by Professor Esser, reassessing the role of non-executive directors more than twenty years after the Higgs Review.",
    "link": "https://www.iod.com/app/uploads/2026/01/FINAL-IoD-Business-Paper-NEDs-reimagined-14.01-6ca5096ee6348f2301347e942a1ffe29.pdf"
  },
  {
    "title": "Reimagining Non-Executive Directors Event",
    "date": "2026-02-03",
    "description": "Launch event for the NEDs Reimagined report at the Institute of Directors, London, bringing together directors, governance professionals, and policymakers.",
    "link": "https://www.iod.com/events/reimagining_non-executive_directors243644099/"
  },
  {
    "title": "Anthropy 2026",
    "date": "2026-01-17",
    "description": "I am looking forward to joining 2,000 cross-sector leaders at #Anthropy26, where we will explore a brighter vision for Britain over the next 30 years. I am excited to play my part in inspiring a more united future for the United Kingdom. I will be there from 25-27 March at the Eden Project, Cornwall.",
    "link": "https://www.Anthropy.uk"
  },
  {
    "title": "ESG Ratings Activities Regulation: A Commentary",
    "date": "2026-01-17",
    "description": "Out now - The Environmental, Social and Governance (ESG) Ratings Activities Regulation: A Commentary. Edited by Andrea Miglionico, Associate Professor, School of Law University of Reading, UK. Available in print and eBook through our website. Available for your law firm or institution through Elgaronline, where Chapter 1 is currently free to access.",
    "link": "https://www.e-elgar.com/shop/isbn/9781035338610"
  },
  {
    "title": "New Article",
    "date": "2026-01-28",
    "description": "New article on Corporate Governance and Higher Education.",
    "link": "https://www.research.ed.ac.uk/en/publications/lost-in-transplantation-the-challenge-of-deploying-comply-or-expl/"
  },
  {
    "title": "Shortlisted: LexisNexis",
    "date": "2026-02-06",
    "description": "Very excited to be shortlisted for the LexisNexis UK legal awards. This is for the work done by our incredible Commercial Law Team at the University of Glasgow School of Law. In the category: University Commercial Impact Award — this category recognises universities that excel in equipping their law students with strong commercial awareness and strategic thinking skills."
  }
]
